---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.FlexPipeType
source: html/45b01e9f-bd34-6122-ccaa-327bbc84bc53.htm
---
# FlexPipeType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.